{
  "model_type": "qwen3_encdec",
  "vocab_size": 152036,
  "hidden_size": 1024,
  "num_hidden_layers": 28,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "intermediate_size": 2816,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-6,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "max_position_embeddings": 32768,
  "attention_dropout": 0.0,
  "sliding_window": 32768,
  "layer_types": null,
  "tie_word_embeddings": true,
  "use_merged_attention": true,
  "is_encoder_decoder": true,
  "num_sentinel_tokens": 100,
  "sentinel_token_start_id": 151936,
  "initializer_range": 0.02,
  "use_cache": true,
  "pad_token_id": null,
  "bos_token_id": null,
  "eos_token_id": null,
  "decoder_start_token_id": null,
  "architectures": ["Qwen3ForSeq2SeqLM"],
  "transformers_version": "4.40.0"
}
